In [6]:
import pandas as pd
import numpy as np

# 1 Creating a datatrame from an arry

# 1.1 Option 1

In [8]:
# creating an array
data = np.array([[1, 4], [2, 5], [3, 6]])

In [11]:
# creating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
            columns=['col1', 'col2'])

In [12]:
# showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 1.2 Option 2

In [16]:
# Creating an arry with list shpe
data = [[1, 4], [2, 5], [3, 6]]

In [17]:
# Creating a dataframe
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
            columns=['col1', 'col2'])

In [18]:
# Showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2 Creating a DataFrame from a dictionary

In [22]:
# list used for this example
states = ['California', 'Texas', 'Florida', 'New York']
population = [354987654, 15646542, 5646535, 65465465]

In [24]:
# Storing lists within a dictionary
dict_states = {'States': states, 'Population': population}

In [26]:
# Creationg the dataframe
df_population = pd.DataFrame(dict_states)

In [27]:
# shoeing the dataframe
df_population

       States  Population
0  California   354987654
1       Texas    15646542
2     Florida     5646535
3    New York    65465465

# 3 Creating a dataFrame from a csv file

In [35]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [37]:
# showing first 5 rows in a dataframe
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86